РП/src/Documents/ПроцессПодготовкиБюджетов/ПроцессПодготовкиБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроцессПодготовкиБюджетов</name>
  <basedOn>Catalog.ЭтапыПодготовкиБюджетов</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>МодельБюджетирования</name>
    <type>
      <types>CatalogRef.МоделиБюджетирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаЭтапов</name>
    <type>
      <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПроцессовПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеКОписанию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиИерархии</name>
    <attributes>
      <name>ГруппаЭтапов</name>
      <type>
        <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапПодготовкиБюджетов</name>
      <type>
        <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПовторяемыйЭтапПодготовкиБюджетов</name>
      <type>
        <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиРасчета</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапПодготовкиБюджетов</name>
      <type>
        <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПовторяемыйЭтапПодготовкиБюджетов</name>
      <type>
        <types>CatalogRef.ЭтапыПодготовкиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДлительности</name>
      <type>
        <types>EnumRef.ТипыСроковЭтаповПодготовкиБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>НеВыполняется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыполнятьАвтоматически</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РП/src/Enums/СтатусыПроцессовПодготовкиБюджетов/СтатусыПроцессовПодготовкиБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроцессовПодготовкиБюджетов</name>
  <enumValues>
    <name>Незапущен</name>
  </enumValues>
  <enumValues>
    <name>Выполняется</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/ТипыДействийЭтаповПодготовкиБюджетов/ТипыДействийЭтаповПодготовкиБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДействийЭтаповПодготовкиБюджетов</name>
  <enumValues>
    <name>ВводЭкземпляраБюджета</name>
  </enumValues>
  <enumValues>
    <name>ВводПлана</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЗначенийНефинансовыхПоказателей</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеБюджетов</name>
  </enumValues>
  <enumValues>
    <name>ПовторГруппыЭтапов</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЛимитовРасходаДС</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/СтатусыПланов/СтатусыПланов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПланов</name>
  <comment>Статусы планов</comment>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ВПодготовке</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/СтатусыМоделейБюджетирования/СтатусыМоделейБюджетирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыМоделейБюджетирования</name>
  <enumValues>
    <name>ВРазработке</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяДолжность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Catalogs/ЭтапыПодготовкиБюджетов/ЭтапыПодготовкиБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыПодготовкиБюджетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.МоделиБюджетирования</owners>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>130</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеРасписания</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>EnumRef.ТипыДействийЭтаповПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиКонтрольныхОтчетов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаДействия</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНастройкиДействия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДлительности</name>
    <type>
      <types>EnumRef.ТипыСроковЭтаповПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеДлительности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокВыполненияЭтапов</name>
    <type>
      <types>EnumRef.ПорядокВыполненияЭтаповПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеЗапуска</name>
    <type>
      <types>EnumRef.ТипыУсловийЗапускаЭтаповПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Срок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСрока</name>
    <type>
      <types>EnumRef.ТипыСроковЭтаповПодготовкиБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыполняется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

РП/src/Documents/ПроцессПодготовкиБюджетов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем ФлагЗакрытия;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Статус = Перечисления.СтатусыПроцессовПодготовкиБюджетов.Незапущен;
		Объект.Ответственный = Пользователи.АвторизованныйПользователь();
		Если Параметры.Свойство("Основание") И ЗначениеЗаполнено(Параметры.Основание) Тогда
			Объект.ГруппаЭтапов = Параметры.Основание;
			Объект.МодельБюджетирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Основание, "Владелец");
			Если Не МодельБюджетированияДействует(Объект.МодельБюджетирования) Тогда
				ВызватьИсключение(НСтр("ru='Модель бюджетирования не действует.
                                            |Измените статус у модели для выбора в документе'
                                            |;uk='Модель бюджетування не діє.
                                            |Змініть статус у моделі для вибору в документі'"));
			КонецЕсли;
			ГруппаШаговПриИзмененииНаСервере();
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьДеревоШагов();
	ОтобразитьПериод();
	ОбновитьСтатусыНаСервере();
	УправлениеФормой();
	
	АдресПередачиНастроек = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// МенюОтчеты
	МенюОтчеты.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюОтчеты);
	// Конец МенюОтчеты

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьСтатусыНаСервере();
	УправлениеФормой();
	
	Идентификатор = НайтиСтроки(ДеревоШаговБюджетногоПроцесса.ПолучитьЭлементы(), Новый Структура("ИндексСтатуса", 1));
	Если Идентификатор <> Неопределено Тогда
		Элементы.ДеревоШаговБюджетногоПроцесса.ТекущаяСтрока = Идентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Перем Ошибки;
	
	Если Объект.Статус = Перечисления.СтатусыПроцессовПодготовкиБюджетов.Незапущен Тогда
		Возврат;
	КонецЕсли;
	
	ДеревоПроверки = РеквизитФормыВЗначение("ДеревоШаговБюджетногоПроцесса");
	СтруктураПоиска = Новый Структура("ЭтоГруппа, ВыполнятьАвтоматически", Ложь, Ложь);
	
	СтруктураПоискаНезаполненных = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураПоиска);
	СтруктураПоискаНезаполненных.Вставить("Ответственный", Справочники.Пользователи.ПустаяСсылка());
	НайденныеСтроки = ДеревоПроверки.Строки.НайтиСтроки(СтруктураПоискаНезаполненных, Истина);
	Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл
		ТекстСоообщения = НСтр("ru='Не заполнен ответственный для этапа %1 от %2';uk='Не заповнений відповідальний для етапу %1 від %2'");
		ТекстСоообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСоообщения, 
								НайденнаяСтрока.Наименование, Формат(НайденнаяСтрока.Период, "ДФ=dd.MM.yyyy"));
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ДеревоШаговБюджетногоПроцесса", ТекстСоообщения, "");
	КонецЦикла;
	
	СтруктураПоискаНезаполненных = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураПоиска);
	СтруктураПоискаНезаполненных.Вставить("Длительность", 0);
	НайденныеСтроки = ДеревоПроверки.Строки.НайтиСтроки(СтруктураПоискаНезаполненных, Истина);
	Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл
		ТекстСоообщения = НСтр("ru='Не заполнена длительность для этапа %1 от %2';uk='Не заповнена тривалість для етапу %1 від %2'");
		ТекстСоообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСоообщения, 
								НайденнаяСтрока.Наименование, Формат(НайденнаяСтрока.Период, "ДФ=dd.MM.yyyy"));
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ДеревоШаговБюджетногоПроцесса", ТекстСоообщения, "");
	КонецЦикла;
	
	СтруктураПоискаНезаполненных = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураПоиска);
	СтруктураПоискаНезаполненных.Вставить("ТипДлительности", Перечисления.ТипыСроковЭтаповПодготовкиБюджетов.ПустаяСсылка());
	НайденныеСтроки = ДеревоПроверки.Строки.НайтиСтроки(СтруктураПоискаНезаполненных, Истина);
	Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл
		ТекстСоообщения = НСтр("ru='Не заполнен тип длительности для этапа %1 от %2';uk='Не заповнений тип тривалості етапу %1 від %2'");
		ТекстСоообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСоообщения, 
								НайденнаяСтрока.Наименование, Формат(НайденнаяСтрока.Период, "ДФ=dd.MM.yyyy"));
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ДеревоШаговБюджетногоПроцесса", ТекстСоообщения, "");
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьСтатусыЗадач", 15);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Статус = Перечисления.СтатусыПроцессовПодготовкиБюджетов.Отменен Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	БюджетнаяЗадача.Ссылка
		|ИЗ
		|	Задача.БюджетнаяЗадача КАК БюджетнаяЗадача
		|ГДЕ
		|	БюджетнаяЗадача.ПроцессПодготовкиБюджетов = &ПроцессПодготовкиБюджетов
		|	И НЕ БюджетнаяЗадача.Выполнена";
		
		Запрос.УстановитьПараметр("ПроцессПодготовкиБюджетов", ТекущийОбъект.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбъектЗадача = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			ОбъектЗадача.Выполнена = Истина;
			ОбъектЗадача.ДополнительныеСвойства.Вставить("РежимФормированияЗадач", Истина);
			ОбъектЗадача.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытияОповещения, Параметр, Источник)
	
	ИмяСобытия = ИмяСобытияОповещения;
	ИсточникСобытия = Источник;
	ПодключитьОбработчикОжидания("ВыполнитьЗадачуПоСобытию", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Не ФлагЗакрытия = Истина Тогда
		Если Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыПроцессовПодготовкиБюджетов.Завершен")
			И Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыПроцессовПодготовкиБюджетов.Отменен") Тогда
			Если ВсеЗадачиВыполнены() Тогда
				ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтаФорма), 
					НСтр("ru='Все задачи выполнены. Завершить процесс?';uk='Всі задачі виконані. Завершити процес?'"), РежимДиалогаВопрос.ДаНет);
				Отказ = Истина;
				СтандартнаяОбработка = Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ФлагЗакрытия = Истина;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроцессовПодготовкиБюджетов.Завершен");
		Записать();
		УправлениеФормой();
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаШаговПриИзменении(Элемент)
	
	ГруппаШаговПриИзмененииНаСервере();
	РазвернутьДеревоШагов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПериодНачалоВыбораЗавершение", ЭтотОбъект);
	
	ВидПериода = ОпределитьВидПериода(Объект.Периодичность);
	ОбщегоНазначенияУТКлиент.ВыбратьПериодИзСписка(
				ЭтаФорма,
				Элемент,
				ВидПериода,
				Объект.НачалоПериода,
				ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ПериодичностьПриИзменении(Элемент)
	
	ПривестиЗначениеПериода();
	РазвернутьДеревоШагов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнениеКОписаниюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.ДополнениеКОписанию");
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(
		Элемент.ТекстРедактирования, 
		ЭтотОбъект, 
		"Объект.Комментарий");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормы

&НаКлиенте
Процедура ДеревоШаговБюджетногоПроцессаНеВыполняетсяПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ДеревоШаговБюджетногоПроцесса.ТекущиеДанные;
	ТекущаяСтрока.ИндексСтатуса = ?(ТекущаяСтрока.НеВыполняется, -1, 0);
	
	УстановитьЗначениеТабличнойЧасти("НеВыполняется");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоШаговБюджетногоПроцессаОтветственныйПриИзменении(Элемент)
	
	УстановитьЗначениеТабличнойЧасти("Ответственный");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоШаговБюджетногоПроцессаДлительностьПриИзменении(Элемент)
	
	УстановитьЗначениеТабличнойЧасти("Длительность");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоШаговБюджетногоПроцессаТипДлительностиПриИзменении(Элемент)
	
	УстановитьЗначениеТабличнойЧасти("ТипДлительности");
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоШаговБюджетногоПроцессаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущийЭлементПоля = Элементы.ДеревоШаговБюджетногоПроцесса.ТекущийЭлемент;
	Если ТекущийЭлементПоля.ТолькоПросмотр Тогда
		ОткрытьЗадачу();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// МенюОтчеты
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуОтчет(Команда)
	
	МенюОтчетыКлиент.ВыполнитьПодключаемуюКомандуОтчет(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец МенюОтчеты


&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	
	ОбновитьСтатусыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	
	ОбновитьСтатусыНаСервере();
	ТекущиеДанные = Элементы.ДеревоШаговБюджетногоПроцесса.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ТекущиеДанные.ЭтоГруппа Тогда
		ПоказатьПредупреждение(, НСтр("ru='Установите курсор на этап подготовки бюджетов для создания задачи';uk='Встановіть курсор на етап підготовки бюджетів для створення задачі'"));
	ИначеЕсли ТекущиеДанные.ИндексСтатуса = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Задача еще не началась';uk='Задача ще не почалася'"));
	ИначеЕсли ТекущиеДанные.ИндексСтатуса = 2 Тогда
		ПоказатьПредупреждение(, НСтр("ru='Задача уже выполнена';uk='Задача вже виконана'"));
	Иначе
		ПараметрыТекущейЗадачи = ПараметрыТекущейЗадачи(
										Объект.Ссылка, ТекущиеДанные.ЭтапПодготовкиБюджетов, 
										ТекущиеДанные.ПовторяемыйЭтапПодготовкиБюджетов, ТекущиеДанные.Период,
										АдресПередачиНастроек);
		Если ПараметрыТекущейЗадачи = Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru='Задача еще не сформирована';uk='Задача ще не сформована'"));
			Возврат;
		КонецЕсли;
		ВыполнитьДействиеКлиент(ПараметрыТекущейЗадачи);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Запустить(Команда)
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроцессовПодготовкиБюджетов.Выполняется");
	Если Не ПроверитьЗаполнение() Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроцессовПодготовкиБюджетов.Незапущен");
	КонецЕсли;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Прекратить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПрекратитьЗавершение", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Процесс будет прекращен. Продолжить?';uk='Процес буде припинено. Продовжити?'"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрекратитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроцессовПодготовкиБюджетов.Отменен");
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьБюджет(Команда)
	
	ТекущиеДанные = Элементы.ДеревоШаговБюджетногоПроцесса.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыТекущейЗадачи = ПараметрыТекущейЗадачи(
										Объект.Ссылка, ТекущиеДанные.ЭтапПодготовкиБюджетов, 
										ТекущиеДанные.ПовторяемыйЭтапПодготовкиБюджетов, ТекущиеДанные.Период,
										АдресПередачиНастроек);
	
	Если Не ЗначениеЗаполнено(ПараметрыТекущейЗадачи) Тогда
		ПоказатьПредупреждение(,НСтр("ru='Задача еще не создана';uk='Задача ще не створена'"));
	ИначеЕсли Не ЗначениеЗаполнено(ПараметрыТекущейЗадачи.ТекущийДокумент) Тогда
		ПоказатьПредупреждение(,НСтр("ru='Бюджет в рамках задачи не создавался';uk='Бюджет в рамках задачі не створювався'"));
	Иначе
		ПоказатьЗначение(,ПараметрыТекущейЗадачи.ТекущийДокумент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗадачу()
	
	ТекущиеДанные = Элементы.ДеревоШаговБюджетногоПроцесса.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыТекущейЗадачи = ПараметрыТекущейЗадачи(
										Объект.Ссылка, ТекущиеДанные.ЭтапПодготовкиБюджетов, 
										ТекущиеДанные.ПовторяемыйЭтапПодготовкиБюджетов, ТекущиеДанные.Период,
										АдресПередачиНастроек);
	
	Если Не ЗначениеЗаполнено(ПараметрыТекущейЗадачи) Тогда
		ПоказатьПредупреждение(,НСтр("ru='Задача еще не создана';uk='Задача ще не створена'"));
	Иначе
		ПоказатьЗначение(,ПараметрыТекущейЗадачи.Задача);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьДействиеКлиент(ПараметрыТекущейЗадачи)
	
	Если Модифицированность Тогда
		Если Не ПроверитьЗаполнение() Тогда
			Возврат;
		КонецЕсли;
		Записать();
	КонецЕсли;
	
	Если ПараметрыТекущейЗадачи.Действие = 
			ПредопределенноеЗначение("Перечисление.ТипыДействийЭтаповПодготовкиБюджетов.УтверждениеБюджетов")
		ИЛИ ПараметрыТекущейЗадачи.Действие = 
			ПредопределенноеЗначение("Перечисление.ТипыДействийЭтаповПодготовкиБюджетов.Прочее") Тогда
			
		ОткрытьФорму("Задача.БюджетнаяЗадача.ФормаОбъекта", Новый Структура("Ключ", ПараметрыТекущейЗадачи.Задача));
		
	Иначе
		
		Результат = ВыполнитьДействиеСервер(ПараметрыТекущейЗадачи);
		Если Результат <> Неопределено Тогда
			ОткрытьФорму(Результат.ИмяФормы, Результат.ПараметрыФормы, ЭтаФорма, Результат.Уникальность);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекущийДокумент(СписокДокументов)
	
	Возврат ?(СписокДокументов.Количество(), СписокДокументов[СписокДокументов.Количество()-1].Документ, Неопределено);
	
КонецФункции

&НаСервере
Функция ВыполнитьДействиеСервер(ПараметрыТекущейЗадачи)
	
	ЗадачаОбъект = ПараметрыТекущейЗадачи.Задача.ПолучитьОбъект();
	
	Действие = ЗадачаОбъект.Действие;
	Документ = ТекущийДокумент(ЗадачаОбъект.СписокДокументов);
	
	Записывать = Ложь;
	Результат = Задачи.БюджетнаяЗадача.ВыполнитьДействие(ЗадачаОбъект, 
								ПолучитьИзВременногоХранилища(ПараметрыТекущейЗадачи.СсылкаНаНастройку), Записывать);
	
	Если Записывать Тогда
		ЗадачаОбъект.Записать();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПараметрыТекущейЗадачи(Процесс, ЭтапПроцесса, ПовторяемыйЭтап, Период, АдресПередачиНастроек)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БюджетнаяЗадача.Ссылка,
		|	БюджетнаяЗадача.Действие,
		|	БюджетнаяЗадача.НастройкаДействия,
		|	БюджетнаяЗадача.СписокДокументов.(
		|		НомерСтроки КАК НомерСтроки,
		|		Документ
		|	)
		|ИЗ
		|	Задача.БюджетнаяЗадача КАК БюджетнаяЗадача
		|ГДЕ
		|	БюджетнаяЗадача.ПроцессПодготовкиБюджетов = &ПроцессПодготовкиБюджетов
		|	И БюджетнаяЗадача.ЭтапПодготовкиБюджетов = &ЭтапПодготовкиБюджетов
		|	И БюджетнаяЗадача.ПовторяемыйЭтапПодготовкиБюджетов = &ПовторяемыйЭтапПодготовкиБюджетов
		|	И БюджетнаяЗадача.Период = &Период
		|	И НЕ БюджетнаяЗадача.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("ПовторяемыйЭтапПодготовкиБюджетов", ПовторяемыйЭтап);
	Запрос.УстановитьПараметр("ПроцессПодготовкиБюджетов", Процесс);
	Запрос.УстановитьПараметр("ЭтапПодготовкиБюджетов", ЭтапПроцесса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Результат = Новый Структура("Задача, Действие, СсылкаНаНастройку, ТекущийДокумент", 
										ВыборкаДетальныеЗаписи.Ссылка,
										ВыборкаДетальныеЗаписи.Действие,
										ПоместитьВоВременноеХранилище(ВыборкаДетальныеЗаписи.НастройкаДействия.Получить(), АдресПередачиНастроек),
										ТекущийДокумент(ВыборкаДетальныеЗаписи.СписокДокументов.Выгрузить()));
		
		Возврат Результат;
		
	КонецЦикла;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоШагов()
	
	ДеревоЭтапов = Документы.ПроцессПодготовкиБюджетов.ДеревоЭтаповПроцессаПоДокументу(Объект);
	ЗначениеВРеквизитФормы(ДеревоЭтапов, "ДеревоШаговБюджетногоПроцесса");
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ФормаЗапустить.Видимость = Ложь;
	Элементы.ФормаПрекратить.Видимость = Ложь;
	Элементы.ФормаЗавершить.Видимость = Ложь;
	
	РазрешеноИзменениеНастроек = Ложь;
	Если Объект.Статус = Перечисления.СтатусыПроцессовПодготовкиБюджетов.Выполняется Тогда
		Элементы.ПиктограммыСтатуса.ТекущаяСтраница = Элементы.ПиктограммаВыполняется;
		Если НайтиСтроки(ДеревоШаговБюджетногоПроцесса.ПолучитьЭлементы(), Новый Структура("ИндексСтатуса", 2)) <> Неопределено
			И НайтиСтроки(ДеревоШаговБюджетногоПроцесса.ПолучитьЭлементы(), Новый Структура("ИндексСтатуса", 1)) = Неопределено
			И НайтиСтроки(ДеревоШаговБюджетногоПроцесса.ПолучитьЭлементы(), Новый Структура("ИндексСтатуса", 0)) = Неопределено Тогда
			Элементы.ФормаЗавершить.Видимость = Истина;
		Иначе
			Элементы.ФормаПрекратить.Видимость = Истина;
		КонецЕсли;
	ИначеЕсли Объект.Статус = Перечисления.СтатусыПроцессовПодготовкиБюджетов.Незапущен Тогда
		Элементы.ПиктограммыСтатуса.ТекущаяСтраница = Элементы.ПиктограммаНезапущен;
		Элементы.ФормаЗапустить.Видимость = Истина;
		РазрешеноИзменениеНастроек = Истина;
	ИначеЕсли Объект.Статус = Перечисления.СтатусыПроцессовПодготовкиБюджетов.Отменен Тогда
		Элементы.ПиктограммыСтатуса.ТекущаяСтраница = Элементы.ПиктограммаОтменен;
	Иначе
		Элементы.ПиктограммыСтатуса.ТекущаяСтраница = Элементы.ПиктограммаВыполнено;
	КонецЕсли;
	
	Элементы.МодельБюджетирования.ТолькоПросмотр = Не РазрешеноИзменениеНастроек;
	Элементы.ГруппаШагов.ТолькоПросмотр = Не РазрешеноИзменениеНастроек;
	Элементы.Периодичность.ТолькоПросмотр = Не РазрешеноИзменениеНастроек;
	Элементы.Период.ТолькоПросмотр = Не РазрешеноИзменениеНастроек;
	
КонецПроцедуры

&НаСервере
Процедура ГруппаШаговПриИзмененииНаСервере()
	
	УпорядоченныеПериодичности = Перечисления.Периодичность.УпорядоченныеПериодичности();
	ИндексДокумента = УпорядоченныеПериодичности.Найти(Объект.Периодичность);
	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.ГруппаЭтапов, "Периодичность, ЭтоГруппа, Родитель.Периодичность");
	Если СтруктураРеквизитов.ЭтоГруппа Тогда
		ПериодичностьШага = СтруктураРеквизитов.Периодичность;
	Иначе
		ПериодичностьШага = СтруктураРеквизитов.РодительПериодичность;
	КонецЕсли;
	ИндексШага = УпорядоченныеПериодичности.Найти(ПериодичностьШага);
	Если ИндексШага > ИндексДокумента Тогда
		Объект.Периодичность = ПериодичностьШага;
		Если Не ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
			Объект.НачалоПериода = ТекущаяДата();
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Объект.КонецПериода) Тогда
			Объект.КонецПериода = ТекущаяДата();
		КонецЕсли;
		ПривестиЗначениеПериода();
	Иначе
		ЗаполнитьШагиРасчетаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШагиРасчетаНаСервере(ПовторяемыйЭтапПроцесса = Неопределено, ГруппаПовторяемогоШага = Неопределено)
	
	Если Не ЗначениеЗаполнено(ПовторяемыйЭтапПроцесса) Тогда
		Объект.НастройкиРасчета.Очистить();
		Объект.НастройкиИерархии.Очистить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭтапыПодготовкиБюджетов.Ссылка КАК ЭтапПодготовкиБюджетов,
		|	ВЫБОР
		|		КОГДА ЭтапыПодготовкиБюджетов.Ссылка = &Родитель
		|			ТОГДА НЕОПРЕДЕЛЕНО
		|		ИНАЧЕ ЭтапыПодготовкиБюджетов.Родитель
		|	КОНЕЦ КАК ГруппаЭтапов,
		|	ЭтапыПодготовкиБюджетов.Длительность,
		|	ЭтапыПодготовкиБюджетов.ТипДлительности,
		|	ЭтапыПодготовкиБюджетов.Ответственный,
		|	ЭтапыПодготовкиБюджетов.НеВыполняется,
		|	ЭтапыПодготовкиБюджетов.Код,
		|	ЭтапыПодготовкиБюджетов.ЭтоГруппа,
		|	ЭтапыПодготовкиБюджетов.Периодичность,
		|	ЭтапыПодготовкиБюджетов.Родитель.Периодичность КАК ПериодичностьГруппы,
		|	ЭтапыПодготовкиБюджетов.Действие,
		|	ЭтапыПодготовкиБюджетов.ВыполнятьАвтоматически
		|ИЗ
		|	Справочник.ЭтапыПодготовкиБюджетов КАК ЭтапыПодготовкиБюджетов
		|ГДЕ
		|	ЭтапыПодготовкиБюджетов.Ссылка В ИЕРАРХИИ(&Родитель)";
		
	Если Не ЗначениеЗаполнено(ПовторяемыйЭтапПроцесса) Тогда
		Запрос.УстановитьПараметр("Родитель", Объект.ГруппаЭтапов);
	Иначе
		Запрос.УстановитьПараметр("Родитель", ГруппаПовторяемогоШага);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	УпорядоченныеПериодичности = Перечисления.Периодичность.УпорядоченныеПериодичности();
	ИндексДокумента = УпорядоченныеПериодичности.Найти(Объект.Периодичность);
	
	ВыборкаДетальныеЗаписи.Сбросить();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.ЭтапПодготовкиБюджетов = ГруппаПовторяемогоШага Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.ЭтоГруппа Тогда
			ИндексЗаполнения = УпорядоченныеПериодичности.Найти(ВыборкаДетальныеЗаписи.Периодичность);
		Иначе
			ИндексЗаполнения = УпорядоченныеПериодичности.Найти(ВыборкаДетальныеЗаписи.ПериодичностьГруппы);
		КонецЕсли;
		
		Если ИндексЗаполнения > ИндексДокумента Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоиска = Новый Структура("ГруппаЭтапов, ЭтапПодготовкиБюджетов, ПовторяемыйЭтапПодготовкиБюджетов");
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаДетальныеЗаписи);
		Если ЗначениеЗаполнено(ПовторяемыйЭтапПроцесса) Тогда
			СтруктураПоиска.ПовторяемыйЭтапПодготовкиБюджетов = СтруктураПоиска.ЭтапПодготовкиБюджетов;
			СтруктураПоиска.ЭтапПодготовкиБюджетов = ПовторяемыйЭтапПроцесса;
		КонецЕсли;
		
		Если Не Объект.НастройкиИерархии.НайтиСтроки(СтруктураПоиска).Количество() Тогда
			НоваяСтрока = Объект.НастройкиИерархии.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПоиска);
		КонецЕсли;
	
		Если ВыборкаДетальныеЗаписи.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока.Периодичность = ВыборкаДетальныеЗаписи.ПериодичностьГруппы;
		
		НоваяСтрока = Объект.НастройкиРасчета.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		НоваяСтрока.Период = Объект.НачалоПериода;
		Если ЗначениеЗаполнено(ПовторяемыйЭтапПроцесса) Тогда
			НоваяСтрока.ПовторяемыйЭтапПодготовкиБюджетов = НоваяСтрока.ЭтапПодготовкиБюджетов;
			НоваяСтрока.ЭтапПодготовкиБюджетов = ПовторяемыйЭтапПроцесса;
		КонецЕсли;
		
		СледующийПериод = БюджетированиеКлиентСервер.ДобавитьИнтервал(НоваяСтрока.Период, ВыборкаДетальныеЗаписи.ПериодичностьГруппы, 1);
		Пока СледующийПериод <= Объект.КонецПериода Цикл
			НоваяСтрокаПериода = Объект.НастройкиРасчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаПериода, НоваяСтрока);
			НоваяСтрокаПериода.Период = СледующийПериод;
			СледующийПериод = БюджетированиеКлиентСервер.ДобавитьИнтервал(СледующийПериод, ВыборкаДетальныеЗаписи.ПериодичностьГруппы, 1);
		КонецЦикла;
		
		Если ВыборкаДетальныеЗаписи.Действие = Перечисления.ТипыДействийЭтаповПодготовкиБюджетов.ПовторГруппыЭтапов Тогда
			Если Не ЗначениеЗаполнено(ПовторяемыйЭтапПроцесса) Тогда
				НастройкаДействия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВыборкаДетальныеЗаписи.ЭтапПодготовкиБюджетов, "НастройкаДействия");
				НайденнаяСтрока = НастройкаДействия.Получить().Найти("ГруппаШагов", "Имя");
				Если НайденнаяСтрока <> Неопределено Тогда
					ПовторяемаяГруппа = НайденнаяСтрока.Значение;
					ЗаполнитьШагиРасчетаНаСервере(ВыборкаДетальныеЗаписи.ЭтапПодготовкиБюджетов, ПовторяемаяГруппа);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ПовторяемыйЭтапПроцесса) Тогда
		ЗаполнитьДеревоШагов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОпределитьВидПериода(Периодичность)
	
	Возврат Перечисления.ДоступныеПериодыОтчета[ОбщегоНазначения.ИмяЗначенияПеречисления(Периодичность)];
	
КонецФункции

&НаКлиенте
Процедура ПериодНачалоВыбораЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт

	Если ВыбранныйПериод <> Неопределено Тогда
		
		Период = ВыбранныйПериод.Представление;
		
		Объект.НачалоПериода = ВыбранныйПериод.Значение;
		Объект.КонецПериода = БюджетированиеКлиентСервер.ДатаКонцаПериода(ВыбранныйПериод.Значение, Объект.Периодичность);
		
		ЗаполнитьШагиРасчетаНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьПериод()
	
	Если Не ЗначениеЗаполнено(Объект.Периодичность) Тогда
		Период = "";
		Элементы.Период.Доступность = Ложь;
		Возврат;
	Иначе
		Элементы.Период.Доступность = Истина;
	КонецЕсли;
	
	ВидПериода = ОпределитьВидПериода(Объект.Периодичность);
	СписокПериодов = ОбщегоНазначенияУТКлиентСервер.ПолучитьСписокПериодов(Объект.НачалоПериода, ВидПериода);
	ЭлементСписка = СписокПериодов.НайтиПоЗначению(Объект.НачалоПериода);
	
	Если ЭлементСписка = Неопределено Тогда
		Период = "";
	Иначе
		Период = ЭлементСписка.Представление;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПривестиЗначениеПериода()
	
	Объект.НачалоПериода = БюджетированиеКлиентСервер.ДатаНачалаПериода(Объект.НачалоПериода, Объект.Периодичность);
	Объект.КонецПериода =  БюджетированиеКлиентСервер.ДатаКонцаПериода(Объект.НачалоПериода, Объект.Периодичность);
	
	ОтобразитьПериод();
	ЗаполнитьШагиРасчетаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДеревоШагов()
	
	Для Каждого СтрокаДерева из ДеревоШаговБюджетногоПроцесса.ПолучитьЭлементы() Цикл
		Элементы.ДеревоШаговБюджетногоПроцесса.Развернуть(СтрокаДерева.ПолучитьИдентификатор(), Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеТабличнойЧасти(ИмяПоля)
	
	ТекущиеДанные = Элементы.ДеревоШаговБюджетногоПроцесса.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПоиска = Новый Структура("Период, ЭтапПодготовкиБюджетов, ПовторяемыйЭтапПодготовкиБюджетов");
	ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущиеДанные);
	НайденнаяСтрока = Объект.НастройкиРасчета.НайтиСтроки(СтруктураПоиска)[0];
	НайденнаяСтрока[ИмяПоля] = ТекущиеДанные[ИмяПоля];
	
КонецПроцедуры

&НаСервере
Функция НайтиСтроки(СтрокиДерева, СтруктураПоиска)
	
	Возврат Документы.ПроцессПодготовкиБюджетов.НайтиСтроки(СтрокиДерева, СтруктураПоиска);
	
КонецФункции

&НаСервере
Процедура ОбновитьСтатусыНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ПроцессПодготовкиБюджетов.ЗаполнитьСтатусыЗадачДерева(Объект, ДеревоШаговБюджетногоПроцесса);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗадачаПоОбъекту(Документ, ПроцессПодготовкиБюджетов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БюджетнаяЗадача.Ссылка,
		|	БюджетнаяЗадача.ПометкаУдаления,
		|	БюджетнаяЗадача.Выполнена
		|ПОМЕСТИТЬ БюджетныеЗадачи
		|ИЗ
		|	Задача.БюджетнаяЗадача КАК БюджетнаяЗадача
		|ГДЕ
		|	БюджетнаяЗадача.ПроцессПодготовкиБюджетов = &ПроцессПодготовкиБюджетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БюджетнаяЗадачаСписокДокументов.Ссылка
		|ИЗ
		|	БюджетныеЗадачи КАК БюджетныеЗадачи
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.БюджетнаяЗадача.СписокДокументов КАК БюджетнаяЗадачаСписокДокументов
		|		ПО БюджетныеЗадачи.Ссылка = БюджетнаяЗадачаСписокДокументов.Ссылка
		|ГДЕ
		|	НЕ БюджетныеЗадачи.ПометкаУдаления
		|	И БюджетнаяЗадачаСписокДокументов.Документ = &Документ
		|	И НЕ БюджетныеЗадачи.Выполнена";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.УстановитьПараметр("ПроцессПодготовкиБюджетов", ПроцессПодготовкиБюджетов);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЦикла;
	
КонецФункции

&НаСервереБезКонтекста
Функция СтатусТекущегоДокументаУтвержден(Источник)
	
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, "Статус, Проведен");
	Если РеквизитыДокумента.Статус = Перечисления.СтатусыПланов.ВПодготовке ИЛИ Не РеквизитыДокумента.Проведен Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьЗадачуПоСобытию()
	
	Если ИмяСобытия = "Запись_ПланЗакупок"
		Или ИмяСобытия = "Запись_ПланПродаж"
		Или ИмяСобытия = "Запись_ПланПроизводства"
		Или ИмяСобытия = "Запись_ПланСборкиРазборки"
		Или ИмяСобытия = "Запись_ЭкземплярБюджета"
		Или ИмяСобытия = "Запись_УстановкаЗначенийНФП" Тогда
		
		Задача = ЗадачаПоОбъекту(ИсточникСобытия, Объект.Ссылка);
		Если ЗначениеЗаполнено(Задача) Тогда
			Если ИмяСобытия = "Запись_ЭкземплярБюджета" 
				И НЕ СтатусТекущегоДокументаУтвержден(ИсточникСобытия) Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					НСтр("ru='Для выполнения задачи документ должен быть в статусе ""На утверждении""';uk='Для виконання задачі документ повинен бути в статусі ""На затвердженні""'"));
				
			Иначе
				
				ИДСледующейСтроки = ВыполнитьЗадачуНаСервере(Задача);
				Если ИДСледующейСтроки <> Неопределено Тогда
					Элементы.ДеревоШаговБюджетногоПроцесса.ТекущаяСтрока = ИДСледующейСтроки;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_БюджетнаяЗадача" Тогда
		
		ИДСледующейСтроки = ОбработкаОповещенияЗадачиНаСервере();
		Если ИДСледующейСтроки <> Неопределено Тогда
			Элементы.ДеревоШаговБюджетногоПроцесса.ТекущаяСтрока = ИДСледующейСтроки;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработкаОповещенияЗадачиНаСервере()
	
	ОбновитьСтатусыНаСервере();
	
	УправлениеФормой();
	
	Возврат НайтиСтроки(ДеревоШаговБюджетногоПроцесса.ПолучитьЭлементы(), Новый Структура("ИндексСтатуса", 1));
	
КонецФункции

&НаСервере
Функция ВыполнитьЗадачуНаСервере(Задача)
	
	Попытка
		ЗадачаОбъект = Задача.ПолучитьОбъект();
		ЗадачаОбъект.Заблокировать();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
	ЗадачаОбъект.Выполнена = Истина;
	ЗадачаОбъект.Записать();
	
	ОбновитьСтатусыНаСервере();
	
	УправлениеФормой();
	
	Возврат НайтиСтроки(ДеревоШаговБюджетногоПроцесса.ПолучитьЭлементы(), Новый Структура("ИндексСтатуса", 1));
	
КонецФункции

&НаКлиенте
Процедура ОбновитьСтатусыЗадач()
	
	ОбновитьСтатусыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	
	Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПроцессовПодготовкиБюджетов.Завершен");
	Записать();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура МодельБюджетированияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не МодельБюджетированияДействует(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(,НСтр("ru='Модель бюджетирования не действует.
                                    |Измените статус у модели для выбора в документе'
                                    |;uk='Модель бюджетування не діє.
                                    |Змініть статус у моделі для вибору в документі'"));
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МодельБюджетированияДействует(Модель)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Модель, "Статус") = 
						Перечисления.СтатусыМоделейБюджетирования.Действует;
	
КонецФункции

&НаСервере
Функция ВсеЗадачиВыполнены()
	
	Возврат Документы.ПроцессПодготовкиБюджетов.ВДеревеЭтаповВсеЗадачиВыполнены(ДеревоШаговБюджетногоПроцесса);
	
КонецФункции

#КонецОбласти
